
/*
 *===================================================================================================
 * Program ID   : FN_NEXT_WORK_DAY
 * Description  : 토,일요일을 제외한 영업일의 LeadTime을 계산하여 Return시킴
 * Program History
 *===================================================================================================
 *   Date       In Charge      Description
 *===================================================================================================
 * 2019.10.23   SONG KEE HO     Initial Release [PS02199094B] LG화학 서비스 설명서
 *
 *===================================================================================================
 */
CREATE FUNCTION [dbo].[FN_NEXT_WORK_DAY]
(
  @startDate	date -- Input Date
 ,@interval		int  -- Lead Time
)
RETURNS datetime
AS

BEGIN

----
DECLARE @resulrtDate datetime  -- 결과값
DECLARE @interval_w int	-- Loop용 Lead Time 복제 변수
DECLARE @rCnt int
DECLARE @cCnt int
DECLARE	@cCnt_w int  -- 정수용
----

-- 날짜값이 NULL인경우 무한LOOP발생으로 오늘날짜를 기본값으로 셋팅함
IF @startDate IS NULL
	BEGIN
		SET @startDate = CONVERT(VARCHAR(8), GETDATE(), 112)
	END

----
IF	@interval = 0	
----
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
		BEGIN
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
			SET @resulrtDate = @startDate	-- 제로 값이면 입력받은 날짜 그대로 Return
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
		END
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
	ELSE
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
		BEGIN
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------

			set @interval_w = @interval	-- Loop용 변수에 값복사


			-- Lead Time 값이 음수인경우 Loop용 변수값을 정수로 변환
			if @interval_w < 0
				begin
					set @interval_w = @interval_w * -1
				end
			
			-- Count 변수값 초기화
			SET @rCnt = 1
			SET @cCnt = 1

			WHILE @interval_w >= @rCnt
				-------------------------------------------------------------------------------
				--                                                           Loop 수행 (BEGIN)
				-------------------------------------------------------------------------------
				BEGIN

					-- Lead Time 값이 음수인경우 Count변수값을 정수에서 음수로 변환시킴
					IF	@interval < 0
						BEGIN
							set @cCnt_w = @cCnt * -1
						END
					ELSE
						BEGIN
							set @cCnt_w = @cCnt
						END

					IF 
					( SELECT COUNT(1) FROM SCM_SYS_CALENDAR_M WITH(NOLOCK) WHERE DATE_FULL_NAME = dateAdd(dd, @cCnt_w, @startDate) and  DAYOFWEEK_NO IN ('2','3','4','5','6')) > 0  
						-- 월~금요일인경우만 Count
						BEGIN
							SET @rCnt = @rCnt + 1
						END

						BEGIN
							set @resulrtDate = (select dateAdd(dd, @cCnt_w, @startDate))
						END

					-- Count변수값 Add
					SET @cCnt = @cCnt + 1
				END
				-------------------------------------------------------------------------------
				--                                                           Loop 수행 (END)
				-------------------------------------------------------------------------------
 
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------
		END
		-----------------------------------------------------------------------------------------------------------------------------------------------------------------


  RETURN @resulrtDate

END
